[
  {
    "topicId": 1,
    "description": "Объект внешне выражает некоторое поведение, но в реальности передаёт ответственность за выполнение этого поведения связанному объекту.",
    "url": "https://ru.wikipedia.org/wiki/Шаблон_делегирования"
  },
  {
    "topicId": 2,
    "description": "Гарантирует, что каждый модуль компьютерной программы имеет только одну обязанность и исполняет её с минимумом побочных эффектов на другие части программы.",
    "url": "https://ru.wikipedia.org/wiki/Шаблон_функционального_дизайна"
  },
  {
    "topicId": 3,
    "description": "Создание неизменяемого объекта.",
    "url": "https://ru.wikipedia.org/wiki/Неизменяемый_интерфейс"
  },
  {
    "topicId": 4,
    "description": "Общий метод для структурирования компьютерных программ для того, чтобы их было проще понять.",
    "url": "https://ru.wikipedia.org/wiki/Интерфейс_(шаблон_проектирования)"
  },
  {
    "topicId": 5,
    "description": "В качестве атрибута (как пометки объектной сущности) применяется наличие или отсутствие реализации интерфейса-маркера. В современных языках программирования вместо этого могут применяться атрибуты или аннотации.",
    "url": "https://ru.wikipedia.org/wiki/Интерфейс-маркер_(шаблон_проектирования)"
  },
  {
    "topicId": 6,
    "description": "Позволяет добавлять дополнительные свойства для класса в контейнер (внутри класса), вместо расширения класса новыми свойствами.",
    "url": "https://ru.wikipedia.org/wiki/Контейнер_свойств_(шаблон_проектирования)"
  },
  {
    "topicId": 7,
    "description": "Расширяет шаблон Publish/Subscribe, создавая централизованный канал для событий. Использует объект-представитель для подписки и объект-представитель для публикации события в канале. Представитель существует отдельно от реального издателя или подписчика. Подписчик может получать опубликованные события от более чем одного объекта, даже если он зарегистрирован только на одном канале.",
    "url": "https://ru.wikipedia.org/wiki/Канал_событий_(шаблон_проектирования)"
  }
]